



//для установки локали для терминала, перед cin cout применить
    //system("chcp 65001");//для utf8 , или другую локаль, в которой сохранены исходники
    //system("chcp 65001 > nul"); то же самое, чтобы консоль не выводила сообщение "Active code page: 65001"



    /*
    system("color 0A") - Меняет цвет фона консоли, зеленый текст на черном фоне
    system("color a") зеленый текст на черном фоне
    
    
    system("cls") - Очищает консоль
    
    
    system("pause" //пауза для ожидания нажатия клавиш
    */